[
  {
    "file": "portfolio",
    "name": "Portfolio Website",
    "body": "This portfolio website contains a list of my projects, information about myself, and my resume. The content for each project's page is stored in JSON, and the pages are generated using Python and Jinja. This site is based on Musa's work.",
    "links": [
      {
        "url": "https://github.com/mmsoby/mmsoby.github.io",
        "text": "view source code on GitHub"
      },
      {
        "url": "https://musah.net",
        "text": "view Musa's site"
      }
    ],
    "icon_names": [
      "website",
      "python"
    ]
  },
  {
    "file": "kymanyc",
    "name": "KymaNYC",
    "body": "In my Senior Design Capstone project at the University of Michigan-Dearborn, I was part of a five-member team that developed KymaNYC, a customizable e-commerce website. </p><p> We utilized a tech stack comprising NextJS, React, TypeScript, Firebase, and Stripe for payment processing. A significant achievement of this project was fulfilling the client's unique requirement to operate and maintain the website at zero cost. This was accomplished by strategically leveraging cost-effective platforms and open-source solutions. </p><p> The project, completed between September 2023 and May 2023, showcases our ability to meet complex client needs effectively. I would show a link to the application but unfortunately the client took the site down while preparing their business for launch.",
    "links": [
    ],
    "icon_names": [
      "website",
      "python"
    ]
  },
  {
    "file": "burrdle",
    "name": "Burrdle",
    "body": "In Burrdle I applied my skills in web development to create a NFL-themed Wordle game, but this time using FlutterFire. This web game, which showcases my proficiency in using Flutter for the frontend and Firebase for the backend, offers a unique twist on the popular Wordle game format, tailored for NFL enthusiasts.",
    "links": [
      {
        "url": "https://burrdle.web.app",
        "text": "play the game on desktop"
      }
    ],
    "icon_names": [
      "website",
      "python"
    ]
  },
  {
    "file": "youtube-channel",
    "name": "YouTube Channel",
    "body": "I created a YouTube channel to share what I have learned and showcase my projects. I have created videos on a variety of topics, including my projects, xcode customization, crypto trading bots, java/python installations, and environment configuration. <p></p> To my surprise my most popular video, with 21k views, is about properly installing Java and JavaFX on a M1 mac. The reason I made it in the first place was that at the time the existing documentation was terrible, and it seems many other people shared that frustration. <p></p> I am not necessarily trying to grow my channel as of now, I just enjoy documenting my progress and sharing what I learned. Teaching others has been a great way for me to cement my understanding in a subject. Another benefit I received from making these videos is learning how to script, record, and edit videos.",
    "links": [
      {
        "url": "https://www.youtube.com/@mustafasoby/featured",
        "text": "view my channel"
      },
      {
        "url": "https://www.youtube.com/watch?v=M1v8V7Q90XU",
        "text": "view my most popular video"
      }
    ],
    "icon_names": [
      "website",
      "python"
    ]
  }
]